{
  "title": "AQuest",
  "image": "/projects/aq/hero.jpg",
  "live": "https://www.aquest.com",
  "role": "Frontend Developer",
  "agency": "AQuest",
  "completed": "06.2018",
  "awards": ["Awwwards", "CSS Design Award", "FWA", "Digital Design Awards"],
  "modules": [
    {
      "component": "TextIntro",
      "text": "AQuest è una Creative Production & Technology Company, in grado di realizzare esperienze web e multimediali ad alto impatto. Sono stato Frontend Developer in AQuest dal 2015 al 2018. Questo progetto riguarda il completo re-design del sito istituzionale."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/reel-aq.mp4",
          "alt": "AQuest reel"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "La sfida",
      "text": "Nel 2017, quando abbiamo deciso di rifare il sito, in AQuest non c’erano verticalità in WebGL. Abbiamo deciso di sfruttare quell’occasione per fare formazione e contemporaneamente creare qualcosa di forte impatto visivo, che fosse all'altezza di esperienze WebGL tipiche dei competitor specializzati da anni in questa tecnologia, pur mantenendo tutte le caratteristiche SEO di un sito corporate.",
      "numbers": [
        {
          "value": 4,
          "label": "Riconoscimenti"
        },
        {
          "value": 12,
          "label": "Mesi di lavoro"
        },
        {
          "value": "7+",
          "label": "Persone coinvolte"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/v1.mp4",
          "alt": "AQuest v1"
        },
        {
          "src": "/projects/aq/v2.mp4",
          "alt": "AQuest v2"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "L'attenzione ai dettagli",
      "text": "Tutte le pagine del sito dovevano avere la stessa attenzione al dettaglio, a prescindere da quanto sarebbero state visitate.<br /><br /> Ecco che nei case, ad esempio, per ascoltare gli audio che caratterizzano un'esperienza, abbiamo realizzato dei componenti che simulano delle corde. La pagina 404 contiene il gioco Pong e navigando le pagine i testi si inclinano in funzione della velocità dello scroll."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/ropes.mp4",
          "alt": "AQuest v1"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/pong404.mp4",
          "alt": "AQuest v2"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "Non solo creatività",
      "text": "Questo progetto non ha significato solo creatività dal punto di vista visual, ma è stata anche l’occasione per sperimentare nuovi strumenti di sviluppo.<br /><br />L’intera codebase del frontend è infatti scritta in Flow, che nel 2017 si proponeva di rendere javascript e in particolare React (essendo Flow stesso sviluppato da Facebook) un linguaggio tipato.<br /><br />Per gestire eventi asincroni (request di dati, animazioni, effetti audio, transizioni, ecc) abbiamo abbiamo abbracciato il paradigma reactive facendo massiccio uso di RX.js",
      "technologies": ["React", "Rx", "Flow", "Pixi", "GLSL", "Webpack"]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/aquest-site.jpeg",
          "alt": "AQuest site"
        }
      ]
    },
    {
      "component": "Awards",
      "awards": ["FWA", "Awwwards", "CSS Design Award", "Digital Design Awards"]
    }
  ]
}
