{
  "title": "Sketchin",
  "image": "/projects/sk/hero.jpeg",
  "live": "https://www.sketchin.com",
  "role": "Full-stack developer",
  "agency": "Sketchin",
  "completed": "08.2020",
  "awards": [],
  "modules": [
    {
      "component": "TextIntro",
      "text": "Sketchin è uno studio di advanced-design specializzato in ricerca e trasformazione digitale. Il progetto consiste nel completo re-design del sito istituzionale. Mi sono occupato dello sviluppo full-stack del sito, delle automatizzazioni e degli integration test."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sk-animation.mp4",
          "alt": "Sketchin intro animation"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "La sfida",
      "text": "Data la particolarità delle circostanze, io e altri due UX Engineers, abbiamo dedicato tempo e attenzione allo sviluppo del sito istituzionale tra un progetto e l’altro. Abbiamo affrontato questa sfida astraendo le UI, seguendo le logiche di Atomic Design. Abbiamo creato un backlog contenente card di diversa natura che ciascuno potesse assegnarsi appena ci fossero le condizioni.<br /><br /> Abbiamo concordato fin dall’inizio convenzioni per la scrittura del codice e della documentazione.",
      "technologies": ["React", "Redux", "Next", "postcss", "Lambda"]
    },

    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sk-navi-1.jpg",
          "alt": "Sketchin project filters"
        },
        {
          "src": "/projects/sk/sk-navi-2.jpg",
          "alt": "Sketchin menu navigation"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "Integration test",
      "text": "Parte del tempo è stato dedicato alla scrittura di test automatici che prevenissero i più comuni disservizi. Il mancato funzionamento di un form di contatto invia automaticamente un alert in un canale Slack, dandoci la possibilità di intervenire tempestivamente.<br /><br /> Tutti i form (inclusa la navigazione dalla home alla pagina di contatto) vengono testati quotidianamente tramite dei CRON che eseguono delle pipeline di Gitlab.<br /><br />Per garantire che tutte le pagine vengano generate correttamente restituendo HTML ricco di contenuti, sono stati scritti dei test di Cypress che vengono eseguiti direttamente nel branch di deploy prima che venga pubblicato."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sketchin-form-1.jpeg",
          "alt": "Sketchin project filters"
        },
        {
          "src": "/projects/sk/sketchin-form-2.jpeg",
          "alt": "Sketchin menu navigation"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sk-hero.jpg",
          "alt": "Sketchin services page"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "Automazioni",
      "text": "Tramite Lambda function è stato possibile utilizzare le API di Favro (lo strumento di gestione di progetti utilizzato in Sketchin) per creare e dettagliare automaticamente le card affinché possano essere utilizzate dalle rispettive unit senza spendere effort in data entry."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sk-animation-2.mp4",
          "alt": "Intro animation"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "Un frontend modulare",
      "text": "Per rispondere all'esigenza di poter creare contenuti editoriali sempre diversi, abbiamo usato la Slice Machine di Prismic CMS. Questa funzionalità consente di associare infiniti modelli di dati a rispettivi componenti di React.<br />L'editor può comporre le pagine con il numero di slice (modelli) di cui necessita e nell'ordine che preferisce. Il frontend legge i modelli e restituisce i componenti React corretti.",
      "numbers": [
        {
          "value": "50+",
          "label": "Slice disponibili"
        },
        {
          "value": "6",
          "label": "Mesi di sviluppo"
        },
        {
          "value": "10+",
          "label": "Persone di Sketchin coinvolte"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sk-cards.jpg",
          "alt": "Sketchin projects page"
        }
      ]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/sk/sk-hero-2.jpg",
          "alt": "Sketchin projects page"
        }
      ]
    }
  ]
}
