{
  "loading": "Caricamento",
  "enter": "Entra",
  "role": "Ruolo",
  "agency": "Agenzia",
  "completed": "Completato",
  "intro": {
    "p1": {
      "l1": "Si tratta di tecnologia",
      "l2": "e di metodo di design"
    },
    "p2": {
      "l1": "La ricerca e l'innovazione",
      "l2": "sono il driver per esperienze memorabili"
    },
    "p3": {
      "l1": "Sono un Creative Technologist"
    },
    "p4": {
      "l1": "They Call Me Giulio."
    },
    "scroll_cta": {
      "line1": "Scrolla per",
      "line2": "vedere i progetti"
    }
  },
  "portfolio": {
    "intro": [
      "Creo",
      "esperienze digitali<br />interattive.",
      "Dall'architettura delle informazioni, che determina la narrazione, alla scrupolosa ricerca degli elementi di UI, fino alla cura maniacale delle interazioni.",
      "Ma è l'ottimizzazione del codice a darmi le maggiori soddisfazioni."
    ],
    "portfolio": [
      "Progetti",
      "Ho lavorato per clienti come: Nexi, Sky, Fastweb, AMDL Circle, IBL, Generali, Corner.",
      "Ecco alcuni progetti che ho contribuito a portare in porto, con un approfondimento sulle sfide che ho affrontato."
    ]
  },
  "about": {
    "intro": [
      "Nato a <ImageVenice>Venezia</ImageVenice> nel settembre dell'86, oggi vivo a Como e lavoro per <ImageSketchin>Sketchin</ImageSketchin>, uno studio di advanced-design, come Creative Technologist.",
      "<pre>Venti</pre> anni fa la prima<br />versione di<br /> TheyCallMeGiulio",
      "La terza versione, nel 2004 fu la prima ad avere il dominio di primo livello <ImageTCMGTK>theycallmegiulio.tk</ImageTCMGTK>",
      "Da allora progetto e realizzo esperienze virtuali. Ho studiato diversi linguaggi di programmazione e database per coprire l'intero stack.",
      "Oggi penso in Javsacript."
    ],
    "clan_title": ["Numbers", "One"],
    "clan": [
      "Nei primi anni 2000, la mia principale passione era <ImageBW>Starcraft Brood War</ImageBW>. Con il 56k mi connettevo alla piattaforma multiplayer e sfidavo gli altri giocatori.",
      "A volte capitava che un gruppo di player formasse un Clan. Un team nel quale riconoscersi e creare community. Tra i vari clan di cui ho fatto parte, ricordo i <ImageNO1>Numbers One</ImageNO1>, perchè fui cofondatore.",
      "Nel 2004 realizzai il primo <ImageNO2>n1clan.net</ImageNO2>, e nel 2006 un <ImageNO3>portale Web 2.0</ImageNO3>, con logiche di Login, News, Interviews, Upload e sharing dei replay di gioco. Visual con Adobe Photoshop, frontend con HTML, CSS e Javascript. Backend con PHP Codeigniter e MySql.",
      "Sembra uno stack tecnologico moderno."
    ],
    "method_title": "Metodo<br /><pre>e</pre>riconoscimenti",
    "method": [
      "L'efficacia e l'usabilità di un progetto dipende dalle sinergie che si formano tra designer e developer. In un team non si prescinde dagli altri. Per creare un prodotto di successo il team è essenziale.",
      "Prediligo metodologie Lean<br />e Agili, che decentralizzano<br />i processi decisionali.",
      "Presto molta attenzione al<br />miglioramento continuo,<br />personale e di metodo.",
      "Lungo il mio percorso ho avuto l'onore veder riconosciuti da giurie internazionali alcuni dei progetti ai quali ho lavorato."
    ]
  },
  "contact": {
    "intro": "Don't be shy, say hi!",
    "social_intro": "Anche se non sono un tipo da social network mi potete contattare anche su"
  }
}