{
  "title": "AQuest",
  "image": "/projects/aq/hero.jpg",
  "live": "https://www.aquest.it",
  "role": "Frontend Developer",
  "agency": "AQuest",
  "completed": "06.2018",
  "awards": ["Awwwards", "CSS Design Award", "FWA"],
  "modules": [
    {
      "component": "TextIntro",
      "text": "AQuest è una Creative Production & Technology Company, in grado di realizzare esperienze web e multimediale ad alto impatto emotivo. Ho lavorato in AQuest dal 2015 al 2018 come Front End Developer. Questo progetto riguarda il completo re-design del sito istituzionale."
    },
    {
      "component": "Awards",
      "awards": ["Awwwards", "CSS Design Award", "DDD"]
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/reel-aq.mp4",
          "alt": "AQuest reel"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "La sfida",
      "text": "Nel 2017, quando abbiamo deciso di rifare il sito, non c’erano forti competenze di WebGL in AQuest. Abbiamo deciso di sfruttare quell’occasione per fare R&D e contemporaneamente creare qualcosa di forte impatto visivo, che fosse paragonabile ad esperienze WebGL di competitor specializzati da anni in questa tecnologia."
    },

    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/v1.mp4",
          "alt": "AQuest v1"
        },
        {
          "src": "/projects/aq/v2.mp4",
          "alt": "AQuest v2"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "L'attenzione ai dettagli",
      "text": "Abbiamo voluto prestare la stessa attenzione al dettaglio in tutte le pagine del sito, a prescindere da quanto sarebbero state visitate.<br /><br /> Ecco che nei case, per rappresentare gli audio realizzati per un esperienza, troviamo dei componenti custom che simulano delle corde, o che la pagina 404 contiene un videogame."
    },
    {
      "component": "Media",
      "media": [
        {
          "src": "/projects/aq/aquest-site.jpeg",
          "alt": "AQuest site"
        }
      ]
    },
    {
      "component": "TextTwoColumns",
      "title": "Non solo creatività",
      "text": "Questo progetto non ha significato solo creatività dal punto di vista visual, ma è stata anche l’occasione per sperimentare nuovi strumenti per il development. L’intera codebase è infatti scritta in Flow, che in quegli anni si proponeva di rendere typed javascript e in particolare React (essendo Flow stesso sviluppato da Facebook)."
    }
  ]
}
